# FieldName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomFieldData..::..FieldName Property
CustomFieldData Class See Also
---
The name of this custom field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public string FieldName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FieldName As String
	Get
```

Visual C++
---
```text
public:
property String^ FieldName {
	String^ get ();
}
```

# See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace